package dialog;

import java.util.HashMap;

public class LibraryBase {

	HashMap<String, String> base = new HashMap<String, String>();

	LibraryBase() {
		base.put("привіт ", "Доброго дня. Що Вас цікавить?");
		base.put("добрий день ", "Доброго дня. Що Вас цікавить?");
		base.put("вітати ", "Доброго дня. Що Вас цікавить?");
		base.put("не могти знайти книга ",
				"Введіть повну назву книги та її автора");
		base.put("\"", "Дана книга не знайдена в базі");
		base.put("книга ", "У Вас є формуляр?");
		base.put("так ", "Вітаю! Яку книгу Ви б хотіли?");
		base.put("ні ", "Вам потрібен формуляр, щоб користуватися бібліотекою.");
		base.put("взяти ", "Скористайтесь електронним формуляром.");
		base.put("отримати ", "Скористайтесь електронним формуляром");
		base.put("формуляр ", "Вам потрібен формуляр, щоб користуватися бібліотекою.");
		base.put("любити ", "Що Ви ще любите?");
		base.put("так ", "Ви не здали 5 книг. Заборгованість 3000 грн.");
		base.put("здати ", "Зараз перевіримо. .... У Вас Заборгованість. ВЕРНІТЬ КНИГИ.");
		base.put("хотіти ", "Багато хочете. Ви видалені з бази. Всього найкращого.");
		base.put("бути ", "Введіть номер формуляру і назву книги.");
		base.put("допомога ", "Так. Що Вас цікавить?");
		base.put("я замовляти вона раніше ", "Вибачте. Всі екземпляри замовлені.");
		base.put("чому?", "А Ви як думаєте? Хто попсував наші книги минулого року?");
		base.put("псувати ", "Псували, псували. Не заперечуйте.");
		base.put("до побачення ", "До побачення.");
		base.put("вибачити ", "Вибачаю. На все добре.");
		base.put("куди ", "В бібліотеку. Куди ж ще.");
		base.put("я ви не розуміти ", "Тому Ви і видалені з бази. На все добре.");
	}
}